# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

n = list(map(int, (input("Введите числа через пробел: ").split())))

size = len(n)//2 + 1 if len(n) % 2 != 0 else len(n)//2
odds = [n[i] * n[len(n) - i - 1] for i in range(size)]

print(f"{n} => {odds}")